0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet 
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 15;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    ACMI1_blockage
    {
        type            zeroGradient;
        value           uniform 0;
    }

    ACMI2_blockage
    {
        type            zeroGradient;
        value           uniform 0;
    }

    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }

    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
