system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           6.0;

functions
{
    S
    {
        type            scalarTransport;

        functionObjectLibs ("libutilityFunctionObjects.so");

        resetOnStartUp  false;

        autoSchemes     true;

        outputControl   outputTime;

        fvOptions       
        {
            S-01
            {
                type            scalarExplicitSetValue;

                active          true;

                scalarExplicitSetValueCoeffs
                {
                    selectionMode   cellSet;
                    cellSet         scalarCellSet;

                    injectionRate
                    {
                        S   1;
                    }
                }
            }
        };
    }
}

// ************************************************************************* //
